Ran Plan for 6 projects:

1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
1. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
---

### 1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-api-prod"
        name                               = "marketplace-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:54" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:56" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-prod" -> (known after apply)
      ~ revision                 = 56 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-web-api-execution-role-prod:marketplace-web-api-execution-role-prod-ssm-access"
        name        = "marketplace-web-api-execution-role-prod-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/93ea61c9-28cc-45e6-916d-10820e71083b",
                            "arn:aws:kms:ap-northeast-2:646886795421:key/f3020de8-a983-4918-8223-6a0fbda5f4f6",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-prod:56" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 2. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-scheduler-prod"
        name                               = "marketplace-scheduler-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-prod:62" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-prod:62" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-scheduler-prod" -> (known after apply)
      ~ revision                 = 62 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-scheduler-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-scheduler-execution-role-prod:marketplace-scheduler-execution-role-prod-ssm-access"
        name        = "marketplace-scheduler-execution-role-prod-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/cb0234ca-88c3-46e3-87ed-22e98e4789a8",
                            "arn:aws:kms:ap-northeast-2:646886795421:key/f3020de8-a983-4918-8223-6a0fbda5f4f6",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-prod:62" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-scheduler-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-scheduler-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 3. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-worker-prod"
        name                               = "marketplace-worker-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:60" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:60" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-prod" -> (known after apply)
      ~ revision                 = 60 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

  # module.worker_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-ssm-access"
        name        = "marketplace-worker-execution-role-prod-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/1f0c0d10-1a78-47c8-82c6-436f6a28b901",
                            "arn:aws:kms:ap-northeast-2:646886795421:key/f3020de8-a983-4918-8223-6a0fbda5f4f6",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:60" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 4. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-api-stage"
        name                               = "marketplace-api-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-stage" -> (known after apply)
      ~ revision                 = 256 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 5. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-scheduler-stage"
        name                               = "marketplace-scheduler-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-scheduler-stage" -> (known after apply)
      ~ revision                 = 261 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-scheduler-execution-role-stage:marketplace-scheduler-execution-role-stage-ssm-access"
        name        = "marketplace-scheduler-execution-role-stage-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/667039cf-f3ee-4c0f-8cd1-cc40f325cff8",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-scheduler-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-scheduler-stage
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 6. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-worker-stage"
        name                               = "marketplace-worker-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:205" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:205" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-stage" -> (known after apply)
      ~ revision                 = 205 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

  # module.worker_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-worker-execution-role-stage:marketplace-worker-execution-role-stage-ssm-access"
        name        = "marketplace-worker-execution-role-stage-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/5f0b2c0c-531f-47e1-b58d-d1f37c2e277f",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"
      + role       = "marketplace-worker-task-role-stage"
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"] will be destroyed
  # (because key ["arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"] is not in for_each map)
- resource "aws_iam_role_policy_attachment" "aws-managed" {
      - id         = "marketplace-worker-task-role-stage-20260310071142938500000001" -> null
      - policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage" -> null
      - role       = "marketplace-worker-task-role-stage" -> null
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:205" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-stage
  ```
Plan: 2 to add, 2 to change, 2 to destroy.

---
### Plan Summary

6 projects, 6 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```